In [1]:
import pandas as pd

In [3]:
#Ans 1

In [4]:
data = [[3,4,5,6,7],[3,0,9,8,7],[4,3,5,6,7]]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  3  4  5  6  7
1  3  0  9  8  7
2  4  3  5  6  7

In [5]:
df.mean()

0    3.333333
1    2.333333
2    6.333333
3    6.666667
4    7.000000
dtype: float64

In [8]:
df = pd.Series([4,5,6,7,8,9])
type(df)

pandas.core.series.Series

In [12]:
df = pd.read_csv("services.csv")

In [14]:
#Ans 2

In [15]:
data = [['lea','hea','few'],['foo','zoo','moo'],['bean','team','lore']]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

      A     B     C
0   lea   hea   few
1   foo   zoo   moo
2  bean  team  lore

In [16]:
df.reindex([1,3])

     A    B    C
1  foo  zoo  moo
3  NaN  NaN  NaN

In [17]:
#Ans 3

In [18]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [19]:
def sum_three(df):
    first_three = df.iloc[:3]  # select the first three rows
    return first_three.sum() 
sum_three(df)

Values    60
dtype: int64

In [20]:
#Ans 4

In [21]:
data = {'Text':['goo','retr','iokjui']}
df = pd.DataFrame(data)
df

     Text
0     goo
1    retr
2  iokjui

In [22]:
df['Word_Count'] = df['Text'].str.len()
df

     Text  Word_Count
0     goo           3
1    retr           4
2  iokjui           6

In [23]:
#Ans 5

In [24]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.size

8

In [25]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.shape

(4, 2)

In [26]:
df

  name  Age
0   ye    3
1  fee    4
2  gol    5
3  jho    7

In [27]:
#Ans 6

pd.read_excel("excel_file_path")

In [33]:
#Ans 7

In [34]:
df = pd.DataFrame({'Email':['john.doe@example.com','nazer@gmail.com']})
df

                  Email
0  john.doe@example.com
1       nazer@gmail.com

In [35]:
#Ans 8

In [36]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [37]:
new_df = df[(df['A'] > 5)  & (df['B'] < 10 )]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [38]:
#Ans 9

In [39]:
df = pd.DataFrame({'Values': [2,3,4,5,6,7,8]})
df

   Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [40]:
df.describe()

         Values
count  7.000000
mean   5.000000
std    2.160247
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

In [41]:
df.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of    Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8>

In [42]:
df.median

<bound method NDFrame._add_numeric_operations.<locals>.median of    Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8>

In [43]:
df.std

<bound method NDFrame._add_numeric_operations.<locals>.std of    Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8>

In [44]:
#Ans 10

In [47]:
import numpy as np

In [48]:
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     437 2023-02-10
1     266 2023-02-11
2     585 2023-02-12
3     173 2023-02-13
4     739 2023-02-14
5     891 2023-02-15
6     892 2023-02-16
7     314 2023-02-17
8     632 2023-02-18
9     916 2023-02-19
10    326 2023-02-20
11    491 2023-02-21
12    404 2023-02-22
13    758 2023-02-23
14    984 2023-02-24
15    428 2023-02-25
16    936 2023-02-26

In [49]:
df['Moving Average'] = df['Sales'].rolling(window=7).mean().round(2)
df

         Date  Sales  Moving Average
0  2023-02-10    437             NaN
1  2023-02-11    266             NaN
2  2023-02-12    585             NaN
3  2023-02-13    173             NaN
4  2023-02-14    739             NaN
5  2023-02-15    891             NaN
6  2023-02-16    892          569.00
7  2023-02-17    314          551.43
8  2023-02-18    632          603.71
9  2023-02-19    916          651.00
10 2023-02-20    326          672.86
11 2023-02-21    491          637.43
12 2023-02-22    404          567.86
13 2023-02-23    758          548.71
14 2023-02-24    984          644.43
15 2023-02-25    428          615.29
16 2023-02-26    936          618.14

In [50]:
#Ans 11

In [51]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [52]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [53]:
#Ans 12

In [54]:
data = pd.date_range(start='2022-12-01', end='2023-02-28')
df_date = pd.DataFrame(data, columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [55]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df['Date'] > start) & (df['Date'] < end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday